JJJJJustinW/STM32_ADDA/Serial/Serial.c
#include "stm32h7xx_hal.h"
#include "usart.h"
#include "Serial.h"

UART_HandleTypeDef *huart_debug = &huart4; ///< Debug串口
UART_HandleTypeDef *huart_screen = &huart5;

uint8_t tmp_Byte=0;//Used to avoid empty pointer



/////////////////////////////UART SEND
/*
The function to send a single byte of information to tx port
*/
void Serial_SendByte(uint8_t Byte)
{
	tmp_Byte=Byte;
	HAL_UART_Transmit(huart_debug,&tmp_Byte,sizeof(Byte),10);
//	UART_WaitOnFlagUntilTimeout(huart_debug,UART_FLAG_TC,SET,1,10);
	while(__HAL_UART_GET_FLAG(huart_debug,UART_FLAG_TC)!=SET);
	
}

void Serial_SendByte_t(uint8_t Byte,UART_HandleTypeDef *huart)
{
	tmp_Byte=Byte;
	HAL_UART_Transmit(huart,&tmp_Byte,sizeof(Byte),10);
//	UART_WaitOnFlagUntilTimeout(huart_debug,UART_FLAG_TC,SET,1,10);
	while(__HAL_UART_GET_FLAG(huart,UART_FLAG_TC)!=SET);
	
}



/*
Send arrays of uint8_t items
*/
void Serial_SendArr(uint8_t *array,uint16_t length)
{
	for(uint16_t itor_sndarr=0;itor_sndarr<length;itor_sndarr++)
	{
		Serial_SendByte(array[itor_sndarr]);
	}
	
}

void Serial_SendArr_t(uint8_t *array,uint16_t length,UART_HandleTypeDef *huart)
{
	for(uint16_t itor_sndarr=0;itor_sndarr<length;itor_sndarr++)
	{
		Serial_SendByte_t(array[itor_sndarr],huart);
	}
	
}




//IMPLEMENTED IN NORMAL METHOD
//uint32_t Serial_Power(uint32_t base,uint32_t pow)
//{
//	uint32_t res=1;
//	while(pow--)
//	{
//		res*=base;
//	}
//	return res;
//}


/*
Implement the power through RECURSION
*/
uint32_t Serial_Power(uint32_t base,uint32_t exp)
{
	if(exp==0){return 1;}
	if(exp%2==0)
	{
		uint32_t halfPow=Serial_Power(base,exp/2);
		return halfPow*halfPow;
	}
	else
	{
		return base*Serial_Power(base,exp-1);
	}
}

/*
Send Numbers to tx port
*/
void Serial_SendNum(uint32_t num)
{
	uint16_t length=0;
	for(uint32_t stp_sendNum=0;stp_sendNum<65535;stp_sendNum++)
	{
		if(num/(Serial_Power(10,stp_sendNum))==0)
		{
			length=stp_sendNum;
			break;
		}
	}
	for(uint16_t stp_sndnuml=0;stp_sndnuml<length;stp_sndnuml++)
	{
		Serial_SendByte(num/Serial_Power(10,length-1-stp_sndnuml)%10+'0');
	}
}


/*
Send strings to tx port
*/
void Serial_SendStr(char *string)
{
	for(uint16_t itor_sndstr=0;string[itor_sndstr]!=0;itor_sndstr++)
	{
		Serial_SendByte(string[itor_sndstr]);
	}
}

void Serial_SendStr_t(char *string,UART_HandleTypeDef *huart)
{
	for(uint16_t itor_sndstr=0;string[itor_sndstr]!=0;itor_sndstr++)
	{
		Serial_SendByte_t(string[itor_sndstr],huart);
	}
}



/*
REPLACES the fputc() function used in the implementation of printf()
*/
int fputc(int ch,FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}



/*
Encapsulated printf function for formatted strings to all ports.
NOTE:
If wish to use Chinese characters, first add "--no-multibyte-chars" argument to the Misc Control in Target Options,
then change the serial port coding to "UTF-8" compatible.
Or use GB2310 compatible in Configuration and change the port to "GBK".
*/
void Serial_printf(const char *formatted,...)
{
	char String[100];
	va_list	args;
	va_start(args,formatted);
	vsprintf(String,formatted,args);
	va_end(args);
	Serial_SendStr(String);
}


//////////////////////////////////////////////////////////
//SEND TO SCREEN





//usually no need to use this, since the commands for the screen are better inputted like strings. 
//THIS ONE INCLUDES THE EXTRA BIT NEEDED FOR COMMAND INPUTTING
void Screen_SendArr(uint8_t *array,uint16_t length)
{
	
	//FEEDBACK TO UART4
	Serial_SendStr_t("\r\nSent to screen:\r\n",huart_debug);
	for(uint16_t itor_sndarr=0;itor_sndarr<length;itor_sndarr++)
	{
		Serial_SendByte_t(array[itor_sndarr],huart_debug);
	}
	Serial_SendByte_t(0xFF,huart_debug);
	Serial_SendByte_t(0xFF,huart_debug);
	Serial_SendByte_t(0xFF,huart_debug);
	Serial_SendStr_t("\r\n",huart_debug);
	
	
	//SEND TO UART5
	for(uint16_t itor_scrsndarr=0;itor_scrsndarr<length;itor_scrsndarr++)
	{
		Serial_SendByte_t(array[itor_scrsndarr],huart_screen);
	}
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
}


void Screen_SendArrToShow(uint8_t *array,uint16_t length,uint8_t FB)
{
	
	//FEEDBACK TO UART4
	if(FB==FB_ON)
	{
		Serial_SendStr_t("\r\nSent to screen:\r\n",huart_debug);
		Serial_SendStr_t("recv_txt.txt=\"",huart_debug);
		for(uint16_t itor_sndarr=0;itor_sndarr<length;itor_sndarr++)
		{
			Serial_SendByte_t(array[itor_sndarr],huart_debug);
		}
		Serial_SendStr_t("\"",huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendStr_t("\r\n",huart_debug);
	}
	
	//SEND TO UART5
	Serial_SendStr_t("recv_txt.txt=\"",huart_screen);
	for(uint16_t itor_scrsndarr=0;itor_scrsndarr<length;itor_scrsndarr++)
	{
		Serial_SendByte_t(array[itor_scrsndarr],huart_screen);
	}
	Serial_SendStr_t("\"",huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
}


void Screen_SendStr(char *string,uint8_t FB)
{
	//FEEDBACK TO UART4
	if(FB==FB_ON)
	{
		Serial_SendStr_t("\r\nSent to screen:\r\n",huart_debug);
		for(uint16_t itor_scrsndstr=0;string[itor_scrsndstr]!=0;itor_scrsndstr++)
		{
			Serial_SendByte_t(string[itor_scrsndstr],huart_debug);
		}
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendStr_t("\r\n",huart_debug);
	}
	
	//SEND TO UART5
	for(uint16_t itor_scrsndstr=0;string[itor_scrsndstr]!=0;itor_scrsndstr++)
	{
		Serial_SendByte_t(string[itor_scrsndstr],huart_screen);
	}
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
}

void Screen_SendStr_b(char *string)
{
	
	
	//SEND TO UART5
	for(uint16_t itor_scrsndstr=0;string[itor_scrsndstr]!=0;itor_scrsndstr++)
	{
		Serial_SendByte_t(string[itor_scrsndstr],huart_screen);
	}
}


void Screen_SendStrToShow(char *string,uint8_t FB)
{
	//FEEDBACK TO UART4
	if(FB==FB_ON)
	{
		Serial_SendStr_t("\r\nSent to screen:\r\n",huart_debug);
		Serial_SendStr_t("recv_txt=\"",huart_debug);
		for(uint16_t itor_scrsndstr=0;string[itor_scrsndstr]!=0;itor_scrsndstr++)
		{
			Serial_SendByte_t(string[itor_scrsndstr],huart_debug);
		}
		Serial_SendStr_t("\"",huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendByte_t(0xFF,huart_debug);
		Serial_SendStr_t("\r\n",huart_debug);
	}
	
	
	//SEND TO UART5
	Serial_SendStr_t("recv_txt.txt=\"",huart_screen);
	for(uint16_t itor_scrsndstr=0;string[itor_scrsndstr]!=0;itor_scrsndstr++)
	{
		Serial_SendByte_t(string[itor_scrsndstr],huart_screen);
	}
	Serial_SendStr_t("\"",huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
}



void Screen_SendNum(uint32_t num)
{
	uint16_t length=0;
	for(uint32_t stp_sendNum=0;stp_sendNum<65535;stp_sendNum++)
	{
		if(num/(Serial_Power(10,stp_sendNum))==0)
		{
			length=stp_sendNum;
			break;
		}
	}
	for(uint16_t stp_scrsndnuml=0;stp_scrsndnuml<length;stp_scrsndnuml++)
	{
		Serial_SendByte_t(num/Serial_Power(10,length-1-stp_scrsndnuml)%10+'0',huart_screen);
	}
}



void Screen_SendNumToShow(uint32_t num)
{
	uint16_t length=0;
	for(uint32_t stp_sendNum=0;stp_sendNum<65535;stp_sendNum++)
	{
		if(num/(Serial_Power(10,stp_sendNum))==0)
		{
			length=stp_sendNum;
			break;
		}
	}
	Serial_SendStr_t("recv_txt.txt=\"",huart_screen);
	for(uint16_t stp_scrsndnuml=0;stp_scrsndnuml<length;stp_scrsndnuml++)
	{
		Serial_SendByte_t(num/Serial_Power(10,length-1-stp_scrsndnuml)%10+'0',huart_screen);
	}
	Serial_SendStr_t("\"",huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	Serial_SendByte_t(0xFF,huart_screen);
	
	
//	Serial_SendStr_t("recv_txt.txt=\"",huart_debug);
//	for(uint16_t stp_scrsndnuml=0;stp_scrsndnuml<length;stp_scrsndnuml++)
//	{
//		Serial_SendByte_t(num/Serial_Power(10,length-1-stp_scrsndnuml)%10+'0',huart_debug);
//	}
//	Serial_SendStr_t("\"",huart_debug);
//	Serial_SendByte_t(0xFF,huart_debug);
//	Serial_SendByte_t(0xFF,huart_debug);
//	Serial_SendByte_t(0xFF,huart_debug);
//	Serial_SendStr_t("\r\n",huart_debug);
	
}



///////////////////////////////////////////////////////////////////////////////////
//RECEIVE PART


uint8_t USART4_RX_BUF[USART_REC_LEN];     //接收缓冲,最大USART_REC_LEN个字节. An Array! Use the sendArr function
uint8_t USART5_RX_BUF[USART_REC_LEN];

//接收状态
//bit15，	接收完成标志
//bit14，	接收到0x0d
//bit13~0，	接收到的有效字节数目-----指定写入RX_BUF的index
uint16_t USART4_RX_STA=0;       //接收状态标记	
uint8_t aRxBuffer[RXBUFFERSIZE];//HAL库使用的串口接收缓冲

uint16_t USART5_RX_STA=0;
uint8_t aRxBuffer5[RXBUFFERSIZE];

uint16_t uart_rx_len=0;


void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	//Serial_printf("RxCpltCallback() tag\r\n");
	if(huart->Instance==UART4)//如果是串口4
	{
		if((USART4_RX_STA&0x8000)==0)//接收未完成
		{
			if(USART4_RX_STA&0x4000)//接收到了0x0d
			{
				if(aRxBuffer[0]!=0x0a)USART4_RX_STA=0;//接收错误,重新开始
				else 
				{	
					USART4_RX_STA|=0x8000;	//接收完成了 
					//printf("USART4_RX_BUF[%d]:%s\r\n",USART4_RX_STA,USART4_RX_BUF);	
				}				
			}
			else //还没收到0X0D
			{	
				if(aRxBuffer[0]==0x0d)
					USART4_RX_STA|=0x4000;
				else
				{
					USART4_RX_BUF[USART4_RX_STA&0X3FFF]=aRxBuffer[0] ;
					USART4_RX_STA++;
					if(USART4_RX_STA>(USART_REC_LEN-1))
					{	
						USART4_RX_STA=0;//接收数据错误,重新开始接收	 
							//reply_er();//暂不报错
					}
				}		 
			}
		}
	}
	
	if(huart->Instance==UART5)//如果是串口5
	{
		if((USART5_RX_STA&0x8000)==0)//接收未完成
		{
			if(USART5_RX_STA&0x4000)//接收到了0x0d
			{
				if(aRxBuffer5[0]!=0x0a)USART5_RX_STA=0;//接收错误,重新开始
				else 
				{	
					USART5_RX_STA|=0x8000;	//接收完成了 
					//printf("USART4_RX_BUF[%d]:%s\r\n",USART4_RX_STA,USART4_RX_BUF);	
				}				
			}
			else //还没收到0X0D
			{	
				if(aRxBuffer5[0]==0x0d)
					USART5_RX_STA|=0x4000;
				else
				{
					USART5_RX_BUF[USART5_RX_STA&0X3FFF]=aRxBuffer5[0] ;
					USART5_RX_STA++;
					if(USART5_RX_STA>(USART_REC_LEN-1))
					{	
						USART5_RX_STA=0;//接收数据错误,重新开始接收	 
							//reply_er();//暂不报错
					}
				}		 
			}
		}

	}
	
}

//串口4中断服务程序（除了超时和错误接受处理和cube生成一致）
void UART4_IRQHandler(void)                	
{ 
	//Serial_printf("UART4_IRQHandler() tag\r\n");
	uint32_t timeout=0;
	uint32_t maxDelay=0x1FFFF;
	
	HAL_UART_IRQHandler(huart_debug);	//调用HAL库中断处理公用函数
	
	timeout=0;
	while (HAL_UART_GetState(huart_debug) != HAL_UART_STATE_READY)//等待就绪
	{
	 timeout++;////超时处理
		 if(timeout>maxDelay) 
		{ 
			//reply_er();
			break;	
		}			 
	}
     
	timeout=0;
	while(HAL_UART_Receive_IT(huart_debug, (uint8_t *)aRxBuffer, RXBUFFERSIZE) != HAL_OK)//一次处理完成之后，重新开启中断并设置RxXferCount为1
	{
	 timeout++; //超时处理
	 if(timeout>maxDelay) 
	 { 
		 //reply_er();
		break;	
	 }
	}
	

}



void UART5_IRQHandler(void)                	
{ 
	//Serial_printf("UART5_IRQHandler() tag\r\n");
	uint32_t timeout=0;
	uint32_t maxDelay=0x1FFFF;
	
	HAL_UART_IRQHandler(huart_screen);	//调用HAL库中断处理公用函数
	
	timeout=0;
	while (HAL_UART_GetState(huart_screen) != HAL_UART_STATE_READY)//等待就绪
	{
	 timeout++;////超时处理
		 if(timeout>maxDelay) 
		{ 
			//reply_er();
			break;	
		}			 
	}
     
	timeout=0;
	while(HAL_UART_Receive_IT(huart_screen, (uint8_t *)aRxBuffer5, RXBUFFERSIZE) != HAL_OK)//一次处理完成之后，重新开启中断并设置RxXferCount为1
	{
	 timeout++; //超时处理
	 if(timeout>maxDelay) 
	 { 
		 //reply_er();
		break;	
	 }
	}
	
}

//SEND THE DATA FROM UART4 TO BOTH UART4 and UART5
void print2serial(void)
{
	if(USART4_RX_STA&0x8000)
	{
		uart_rx_len=USART4_RX_STA&0x3fff;
		Serial_printf("\r\nsent data:\r\n");
//			HAL_UART_Transmit_IT(&huart3,(uint8_t*)USART_RX_BUF,len);
//		HAL_UART_Transmit(&huart4,(uint8_t*)USART_RX_BUF,uart_rx_len,1000);  //Original print
		Serial_SendArr((uint8_t*)USART4_RX_BUF,uart_rx_len);
		Screen_SendArrToShow((uint8_t*)USART4_RX_BUF,uart_rx_len,FB_OFF);
		Serial_printf("\r\n");
		while(__HAL_UART_GET_FLAG(&huart4,UART_FLAG_TC)!=SET);		
		USART4_RX_STA=0;
	}
}


//SEND THE DATA FROM UART5 TO UART4
void print2screen(void)
{
	if(USART5_RX_STA&0x8000)
	{
		uart_rx_len=USART5_RX_STA&0x3fff;
		Serial_printf("\r\ndata from screen:\r\n");
		Serial_SendArr((uint8_t*)USART5_RX_BUF,uart_rx_len);
		Serial_printf("\r\n");
		while(__HAL_UART_GET_FLAG(&huart5,UART_FLAG_TC)!=SET);		
		USART5_RX_STA=0;
	}
}



